{
  "config": {
    "step": {
      "user": {
        "title": "Firewalla MSP Setup",
        "description": "Configure your Firewalla integration using MSP API credentials. You'll need a personal access token from your Firewalla MSP account.",
        "data": {
          "msp_url": "MSP API URL",
          "access_token": "Personal Access Token"
        },
        "data_description": {
          "msp_url": "The URL of your Firewalla MSP API endpoint (usually https://firewalla.encipher.io)",
          "access_token": "Your personal access token from the Firewalla MSP account"
        }
      },
      "device_selection": {
        "title": "Select Firewalla Device",
        "description": "Choose which Firewalla device to integrate with Home Assistant. You can create multiple integrations for different devices.",
        "data": {
          "box_gid": "Firewalla Device",
          "name": "Integration Name"
        },
        "data_description": {
          "box_gid": "Select the Firewalla device you want to integrate with Home Assistant",
          "name": "Choose a descriptive name for this integration instance"
        }
      }
    },
    "error": {
      "cannot_connect": "Failed to connect to Firewalla MSP API. Please check your MSP URL and ensure your network connection allows HTTPS access to the API endpoint.",
      "invalid_auth": "Invalid MSP API credentials. Please verify your personal access token is correct and has the necessary permissions to access your Firewalla devices.",
      "no_devices": "No Firewalla devices found in your MSP account. Please ensure your MSP account has access to at least one Firewalla device and that the device is online.",
      "unknown": "An unexpected error occurred while setting up the integration. Please check the Home Assistant logs for more details and try again.",
      "name": "Integration name cannot be empty. Please provide a descriptive name for this integration instance.",
      "timeout": "Connection to Firewalla MSP API timed out. Please check your network connection and try again.",
      "rate_limit": "Too many requests to the Firewalla MSP API. Please wait a moment and try again.",
      "server_error": "Firewalla MSP API server error. The service may be temporarily unavailable. Please try again later."
    },
    "abort": {
      "already_configured": "This Firewalla device is already configured in Home Assistant. Each device can only be configured once per integration instance.",
      "invalid_host": "The provided MSP API URL is not valid. Please check the URL format and try again.",
      "auth_failed": "Authentication with the Firewalla MSP API failed. Please check your credentials and try again."
    }
  },
  "entity": {
    "switch": {
      "block": {
        "name": "{device_name} Internet Block"
      },
      "gaming": {
        "name": "{device_name} Gaming Pause"
      }
    },
    "sensor": {
      "device_status": {
        "name": "{device_name} Status"
      },
      "rules_count": {
        "name": "Active Rules"
      }
    }
  }
}